I didn't realize that the keys I deleted where created from terraform in the `simpleinfra/terraform/rustc-ci` module. The keys deletion resulted in a `terraform plan` diff:

```

Terraform detected the following changes made outside of Terraform since the last "terraform apply" which may have affected this plan:

  # module.public.module.artifacts_user.aws_iam_access_key.ci has been deleted
  - resource "aws_iam_access_key" "ci" {
      - id                   = "AKIA46X5W6CZDRNFRBJK" -> null
      - secret               = (sensitive value) -> null
        # (4 unchanged attributes hidden)
    }

  # module.public.module.caches_user.aws_iam_access_key.ci has been deleted
  - resource "aws_iam_access_key" "ci" {
      - id                   = "AKIA46X5W6CZGPEWL7UN" -> null
      - secret               = (sensitive value) -> null
        # (4 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or
respond to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.public.module.artifacts_user.aws_iam_access_key.ci will be created
  + resource "aws_iam_access_key" "ci" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "ci--rust-lang--rust--artifacts"
    }

  # module.public.module.artifacts_user.aws_iam_user.ci will be updated in-place
  ~ resource "aws_iam_user" "ci" {
        id            = "ci--rust-lang--rust--artifacts"
        name          = "ci--rust-lang--rust--artifacts"
      ~ tags          = {
          - "AKIA46X5W6CZAWZRBC7B" = "Created by Marco when migrating from rust-lang-ci org. Stored in GitHub Actions environments secrets." -> null
        }
      ~ tags_all      = {
          - "AKIA46X5W6CZAWZRBC7B" = "Created by Marco when migrating from rust-lang-ci org. Stored in GitHub Actions environments secrets." -> null
        }
        # (4 unchanged attributes hidden)
    }

  # module.public.module.artifacts_user.github_actions_secret.aws_access_key_id must be replaced
-/+ resource "github_actions_secret" "aws_access_key_id" {
      ~ created_at      = "2021-10-17 14:40:34 +0000 UTC" -> (known after apply)
      ~ id              = "rust:ARTIFACTS_AWS_ACCESS_KEY_ID" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2021-10-17 14:40:34 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.public.module.artifacts_user.github_actions_secret.aws_secret_access_key must be replaced
-/+ resource "github_actions_secret" "aws_secret_access_key" {
      ~ created_at      = "2021-10-17 14:40:32 +0000 UTC" -> (known after apply)
      ~ id              = "rust:ARTIFACTS_AWS_SECRET_ACCESS_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2021-10-17 14:40:32 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.public.module.caches_user.aws_iam_access_key.ci will be created
  + resource "aws_iam_access_key" "ci" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "ci--rust-lang--rust--caches"
    }

  # module.public.module.caches_user.github_actions_secret.aws_access_key_id must be replaced
-/+ resource "github_actions_secret" "aws_access_key_id" {
      ~ created_at      = "2021-10-17 14:40:34 +0000 UTC" -> (known after apply)
      ~ id              = "rust:CACHES_AWS_ACCESS_KEY_ID" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2021-10-17 14:40:34 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.public.module.caches_user.github_actions_secret.aws_secret_access_key must be replaced
-/+ resource "github_actions_secret" "aws_secret_access_key" {
      ~ created_at      = "2021-10-17 14:40:32 +0000 UTC" -> (known after apply)
      ~ id              = "rust:CACHES_AWS_SECRET_ACCESS_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2021-10-17 14:40:32 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 1 to change, 4 to destroy.
```

I discussed this with JD.

## Learnings

- The GitHub CI was using the [legacy](https://github.com/rust-lang/simpleinfra/blob/e6c0a989dbcbc4f45d6314f3e7bf7ac8aa339931/terraform/rustc-ci/impl/artifacts.tf#L68) keys. The once I deleted are the ones created from the [gha-iam-user](https://github.com/rust-lang/simpleinfra/blob/e6c0a989dbcbc4f45d6314f3e7bf7ac8aa339931/terraform/rustc-ci/impl/artifacts.tf#L58) module

## Questions

- why the CI didn't switch to the new keys?
- In the rust-lang-ci/rust GitHub Actions secrets we have four `AWS_SECRET_ACCESS_KEY_{ID}` secrets but it seems we only [use](https://github.com/rust-lang/rust/blob/79f82ad5e89aa421e2c765fea2098b23beb69b40/src/ci/github-actions/jobs.yml#L77) two of them. Am I missing something and maybe we need multiple keys because we have different permissions associated to these keys? Why are we using the `{ID}` [technique](https://github.com/rust-lang/rust/blob/79f82ad5e89aa421e2c765fea2098b23beb69b40/.github/workflows/ci.yml#L200) instead of using the secret `ARTIFACTS_AWS_SECRET_ACCESS_KEY` (which seems unused): imo it's a simpler approach.
 
## Plan

Here's how we want to move forward:

1. Leave the terraform module `simpleinfra/terraform/rustc-ci` dirty. I.e. don't touch it for now.
2. Create a new terragrunt module where I copy paste the parts I need for rust-lang/rust (e.g. I don't need the difference between [repo](https://github.com/rust-lang/simpleinfra/blob/e6c0a989dbcbc4f45d6314f3e7bf7ac8aa339931/terraform/rustc-ci/environments.tf#L9) and source anymore). I will use `rustc-ci--rust-lang--rust` as a iam_prefix to avoid conflicts with existing resources.
3. import the buckets into the terragrunt state (with `terraform import`). Instructions [here](https://registry.terraform.io/providers/hashicorp/aws/5.65.0/docs/resources/s3_bucket#import).
3. Apply the module to the [bors-kindergarden](https://github.com/rust-lang/bors-kindergarten) repo to test if the access keys are applied correctly. Jakub, does it make sense to treat bors-kindergarden as the "staging" environment of the rust CI?
4. Apply the same module to rust-lang/rust
5. Migrate rust-lang-ci
6. Delete everything from the `simpleinfra/terraform/rustc-ci` module, except the s3 bucket from this module.


Wdyt?